Revit 2024 API
Noise Members
The Noise type exposes the following members.
Properties
Name | Description
NoiseColor1
 The property labeled "Color 1" from the "Noise" schema.
NoiseColor2
 The property labeled "Color 2" from the "Noise" schema.
NoiseLevels
 The property labeled "Levels" from the "Noise" schema.
NoisePhase
 The property labeled "Phase" from the "Noise" schema.
NoiseSize
 The property labeled "Size" from the "Noise" schema.
NoiseThresholdHigh
 The property labeled "High" from the "Noise" schema.
NoiseThresholdLow
 The property labeled "Low" from the "Noise" schema.
NoiseType
 The property labeled "Noise Type" from the "Noise" schema.
TextureAngle
 The property labeled "Angle" from the "Noise" schema.
TextureLinkTextureTransforms
 The property labeled "Link Transforms" from the "Noise" schema.
TextureRealWorldOffsetX
 The property labeled "Offset X" from the "Noise" schema.
TextureRealWorldOffsetY
 The property labeled "Offset Y" from the "Noise" schema.
TextureRealWorldOffsetZ
 The property labeled "Offset Z" from the "Noise" schema.
See Also
Noise Class
Autodesk.Revit.DB.Visual Namespace